In [5]:
# en ligne de commande : python -m pip install mysql-connector-python
# conda install -c anaconda mysql-connector-python

In [6]:
import mysql.connector

# Connexion à la Base de Données

In [7]:
bdd = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",

)

print(bdd)

<mysql.connector.connection.MySQLConnection object at 0x00000249D1084108>

# 1. Création d ela base de données

In [9]:
mycursor = bdd.cursor()
try:
    mycursor.execute("CREATE DATABASE od")
    print("Base de donnée crée avec succès")
except :
    print("Base Existante")

Base Existante

# 2. Connexion à une Base de Données

In [10]:
bdd = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="od"
)
mycursor = bdd.cursor()

# 3. Creation de  table

In [14]:
mycursor = bdd.cursor()
try:
    mycursor.execute("CREATE TABLE Enseignant (Code int, Nom VARCHAR(50), Prenom varchar(50),salaire int)")
except:
    print("Table créee")

Table créee

# 4. L'instruction Insert into table

In [15]:
sql = "INSERT INTO enseignant (Code, Nom, Prenom, Salaire) VALUES (%s, %s, %s, %s)"
val = (1,"MATY", "Maman",1500000)
val1 = (2,"NAMBILA", "Ane",2000000)
val2 = (3,"KOUSSOUBE", "Souleymane",2500000)
mycursor.execute(sql, val)
mycursor.execute(sql, val1)
mycursor.execute(sql, val2)
bdd.commit()

# 5. Instruction Select

In [16]:
mycursor = bdd.cursor()
sql = "SELECT * FROM enseignant;"
mycursor.execute(sql)
data = mycursor.fetchall()
print("data:", data)

data: [(1, 'MATY', 'Maman', 1500000), (2, 'NAMBILA', 'Ane', 2000000), (3, 'KOUSSOUBE', 'Souleymane', 2500000), (1, 'MATY', 'Maman', 1500000), (2, 'NAMBILA', 'Ane', 2000000), (3, 'KOUSSOUBE', 'Souleymane', 2500000)]

In [17]:
for x in data:
    c,n,p,s=x
    print(c,n,p,s , sep='\t')

1	MATY	Maman	1500000
2	NAMBILA	Ane	2000000
3	KOUSSOUBE	Souleymane	2500000
1	MATY	Maman	1500000
2	NAMBILA	Ane	2000000
3	KOUSSOUBE	Souleymane	2500000

In [18]:
mycursor = bdd.cursor()

mycursor.execute("SELECT * FROM enseignant")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'MATY', 'Maman', 1500000)
(2, 'NAMBILA', 'Ane', 2000000)
(3, 'KOUSSOUBE', 'Souleymane', 2500000)
(1, 'MATY', 'Maman', 1500000)
(2, 'NAMBILA', 'Ane', 2000000)
(3, 'KOUSSOUBE', 'Souleymane', 2500000)

# 6. L'instruction Update set

In [20]:
mycursor = bdd.cursor()

sql = "UPDATE enseignant SET Prenom = 'Ange' WHERE Code = 2"
mycursor.execute(sql)
bdd.commit()

In [21]:
mycursor.execute("SELECT * FROM enseignant")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'MATY', 'Maman', 1500000)
(2, 'NAMBILA', 'Ange', 2000000)
(3, 'KOUSSOUBE', 'Souleymane', 2500000)
(1, 'MATY', 'Maman', 1500000)
(2, 'NAMBILA', 'Ange', 2000000)
(3, 'KOUSSOUBE', 'Souleymane', 2500000)

In [24]:
import pandas as pd
bdd = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="od"
)
df = pd.read_sql("SELECT * FROM enseignant where Prenom like '%e%'", bdd)

In [25]:
df

   Code        Nom      Prenom  salaire
0     2    NAMBILA        Ange  2000000
1     3  KOUSSOUBE  Souleymane  2500000
2     2    NAMBILA        Ange  2000000
3     3  KOUSSOUBE  Souleymane  2500000

In [26]:
df['Nom']

0      NAMBILA
1    KOUSSOUBE
2      NAMBILA
3    KOUSSOUBE
Name: Nom, dtype: object

In [27]:
df[['Nom', 'salaire']]

         Nom  salaire
0    NAMBILA  2000000
1  KOUSSOUBE  2500000
2    NAMBILA  2000000
3  KOUSSOUBE  2500000

In [28]:
df['salaire'] >20000000

0    False
1    False
2    False
3    False
Name: salaire, dtype: bool

In [30]:
df[df['salaire'] > 2000000 ]

   Code        Nom      Prenom  salaire
1     3  KOUSSOUBE  Souleymane  2500000
3     3  KOUSSOUBE  Souleymane  2500000

In [31]:
df.Nom

0      NAMBILA
1    KOUSSOUBE
2      NAMBILA
3    KOUSSOUBE
Name: Nom, dtype: object